#Жигалева Ярослава 125 ПАЭ 
#Задание1
# для региона 19 рассчитайте урожайность пшеницы в 1997 году, взяв для рассчета средние суммы активных температур за текущий год, с 30 ближайших метеостанций

#Проверка рабочей директории
getwd()

#Подключим нужные пакеты
library(tidyverse)
library(rnoaa)
library(lubridate)

#Создание векторов с данными для рассчётов
#коэффициент для экпозиции склона - считаем что все поля идеально ровные
y  =  1
#Константы
ai=c(0.00, 32.11, 26.31, 25.64, 23.20, 18.73, 16.30, 13.83, 0.00)
bi=c(0.00, 11.30, 9.26, 9.03, 8.16, 6.59, 5.73, 4.87, 0.00)
#отношение числа дней i-го месяца, входящих в период вегетации культуры, к общему числу дней в месяце
di=c(0.00, 0.33, 1.00, 1.00, 1.00, 0.32, 0.00, 0.00, 0.00)
#Коэффициент использования ФАР посевом
Kf=300
#Калорийность урожая культуры
Qj=1600
#Коэффициент "Сумма частей основной и побочной продукции
Lj=2.2
#Коэффициент "Стандартная влажность культуры"
Ej=25

#Скачаем общий список метеостанций
#station_data = ghcnd_stations()
station_data=read.csv("station_data.csv")

#Создадим собственный список метеостанций
#После получения всписка всех станций, получите список станций ближайших к столице вашего региона,создав таблицу с именем региона и координатами его столицы
abakan = data.frame(id = "ABAKAN", latitude = 53.7156,  longitude = 91.4292)
abakan_around = meteo_nearby_stations(lat_lon_df = abakan, station_data = station_data, limit = 30, var = c("PRCP", "TAVG"), year_min = 1997, year_max = 1997)

#abakan_around это список единственным элементом которого является таблица, содержащая идентификаторы метеостанций отсортированных по их удалленности от Абакана, очевидно что первым элементом таблицы будет идентификатор метеостанции Абакана, его то мы и попытаемся получить
abakan_id = abakan_around[["ABAKAN"]][["id"]][1]

#Создадим из полученной таблицы в вектор
abakan_id = abakan_id[[1]]
abakan_id2 = abakan_id[1]

###Нужно создать цикл, в котором бы скачивались  нужные данные для всех метеостанций из созданного списка
#Создадим промежуточный объект, куда будем скачивать данные с конкретной метеостанции
all_i = data.frame()

#Создадим объект, куда скачаем все данные с 30 ближайших метеостанций
all_abakan_meteodata = data.frame()

#Цикл для всех метеостанций
for(i in 1:30) 
{ 
  abakan_id = abakan_around[["ABAKAN"]][["id"]][i]
  data = meteo_tidy_ghcnd(stationid = abakan_id,
                          var = "TAVG",
                          date_min = "1997-01-01",
                          date_max = "1997-12-31")
  all_abakan_meteodata = bind_rows(all_abakan_meteodata, data)
}

#Пропишем полученные результаты
write.csv(all_abakan_meteodata,"all_abakan_meteodata.csv")

#ВЫберем данные нужного нам года, добавим колонки year, month, day для группировки
all_abakan = all_abakan_meteodata %>%
mutate (year = year(date), month = month(date), day = day(date)) %>% 
filter(year > 1996 & year < 1998) %>%

#сгруппируем с учётом id метеостанций
group_by(month, id) %>%
  
#Выберем активные температуры (превышающие 5 градусов С)
mutate(tavg=tavg/10) %>% filter (tavg>5) %>%
  
#Вычислим сумму активных температур
summarise(sum = sum (tavg, na.rm = TRUE)) %>%

#Вычислим средие активные температуры по месяцам, предварительно сгруппировав данные
group_by(month) %>%
summarise(S = mean(sum,na.rm = TRUE)) %>%
  
#Рассчитаем урожайность для каждого месяца
mutate(F = ((ai + bi * y * S * di) * Kf)/(Qj * Lj * (100 - Ej)))

#Вычислим суммарную урожайность 
Yield = sum(all_abakan$F); Yield
#Для региона 19 урожайность пшеницы в 1997 году составила 14,17 ц/га, по данным, полученным на основе средней суммы активных температур с 30 ближайших метеостанций